#les 4 premiers chiffres sont les pixels, le 5ème le target top, le 6ème le target bottom
#ordre des pixels de l'image:
#12
#34


data = [
[1, 1, 0, 0, 1, 0],
[0, 0, 1, 1, 0, 1],
[0, 0, 0, 0, 0, 0],
[1, 0, 0, 0, 0, 0],
[0, 1, 0, 0, 0, 0],
[0, 0, 1, 0, 0, 0],
[0, 0, 0, 1, 0, 0],
[0, 1, 1, 0, 0, 0],
[1, 0, 0, 1, 0, 0],
[1, 1, 1, 0, 0, 0],
[1, 1, 0, 1, 0, 0],
[1, 0, 1, 1, 0, 0],
[0, 1, 1, 1, 0, 0],
[1, 1, 1, 1, 0, 0],
[0, 1, 0, 1, 0, 0],
[1, 0, 1, 0, 0, 0],
]

nb_data = len(data)